[
    {
       "Query ID":"27",
       "Query":"Computerized information retrieval systems. Computerized indexing systems.",
       "KL Rate":7.4246284767901916,
       "Document ID":"257",
       "Document Title":"Classification for a General Index Language",
       "Document Body":"The role of classification schemes in libraries and information services has probably caused more argument than any other professional activity. This would be surprising if classification were no more than a fairly convenient way of arranging books on shelves. Some librarians think it is, and support their view by heaping scorn on the heads of those who, like the Classification Research Group, actually spend years of their time in theoretical discussions that seem to result in more and more abstruse and difficult complications to what ought to be a straightforward exercise. Yet today we can see clearly two relatively new spectacles on the library scene: on the one hand, some librarians are criticizing the Decimal Classification (especially as used in the British National Bibliography) for being too detailed and unwieldy; on the other hand, some librarians, and still more information officers, are busy revising the Universal Decimal Classification in order to make it more detailed. In the next field, as it were, computerized indexing and retrieval systems are pounding away at the ever-growing masses of literature, producing results that impress computer specialists but not information users, who are so deafened by the noise that they cannot hear what is new."
    },
    {
       "Query ID":"20",
       "Query":"Testing automated information systems.",
       "KL Rate":6.482959942624938,
       "Document ID":"17",
       "Document Title":"Adventures in Librarianship",
       "Document Body":"There has long been a need for a continuing series to provide scholarly reviews of the rapidly changing and advancing field of librarianship, a series which would select subjects with particular current significance to the profession and provide an analysis of the advances made through research and practice. Advances in Librarianship is planned and designed to fill this need. It will present critical articles and surveys based on the published literature, research in progress, and developments in libraries of all types. Mechanization may appear to be the most obvious of the advancing fronts of librarianship, for automation has caught the enthusiastic support of all librarians who can visualize its potential. Advances in this field will certainly be found in every volume of this series. As the first group of articles in this volume demonstrate, technological change has an obvious and direct implication for libraries, but the problem has been found to be much more complex than the simple inventory problem many experts expected. Advances in Librarianship is dedicated to presenting the realities of automation, assessing where we are, where we are going, and how fast we can hope to get there. \"The Machine and Cataloging\" reviews the current status of the machine-produced book catalog and what lies ahead as we enter the age of MARC. Where business methods have greater applicability, progress is easier, as reported in \"Mechanization of Acquisition Processes.\" Even in this area generally acceptable practices and standardization are in the future, not the past. One of the problems of major and immediate importance in computerization of catalog information is that discussed in \"Filing Systems for Computer Manipulation.\" This detailed review presents the complexity of the problems and suggests possible solutions. For many years technical service costs have been defended without adequate knowledge of the facts. As automated procedures are proposed, standards are determining costs of traditional operations become essential. The article on standards for such costs shows why the problems have been difficult and reviews the significant advances of the past few years. The school library has widened its dimensions in materials and services much more rapidly than other libraries, as reflected in its new name, the instructional media center. Here, technical change, together with new teaching methods, has made possible major developments in library service in schools as well as for children in the public library. Two articles make clear that what can be done has been demonstrated, and that what remains is to make this the rule rather than the exception. Bibliotherapy is an example of a field in which progress has been slow. Articles which illustrate the potential which systems theory and managerial planning theory have for libraries. The articles on the application of these concepts, which come from research in administration, are provocative and may appear controversial to some. The article on library development in developing countries provides an analysis in depth of our efforts and degree of success in assisting other countries in providing the library service which is so important in the modern world."
    },
    {
       "Query ID":"30",
       "Query":"Information dissemination by journals and periodicals.",
       "KL Rate":6.1957929064322546,
       "Document ID":"821",
       "Document Title":"Recent Growth of the Literature of Biochemistry and Changes in Ranking of Periodicals",
       "Document Body":"The ideas and techniques of physics have been systematically applied to the study of living matter since the 1950s and 1960s.. As a result a rapid and large increase has taken place in the research activity in this field and biophysics and molecular biology have emerged as important areas of study.. The consequent enormous growth of literature in the field has created great difficulties in tracking out the significant literature of the subject.. To cope with this unprecedented growth of literature, a ranking list of periodicals in this field has been prepared on the basis of citations in the Annual review of biochemistry for 1968, 1969, and 1970.. This list is expected to reflect the impact of literature on the progress of biochemical knowledge more accurately than the list prepared by Henkle in 1938.. The present list brings out the predominant position of biochemical research in the total scientific effort today, and the increasing bias of cognate disciplines towards biochemical methodologies.. A method of analysis of the number of citations in relation to size of the journal concerned and average length of the papers published has been developed and applied in this study.. The analysis yields three parameters which should be useful in assessing the actual scientific interest of a journal in relation to the number of paper published, compactness of the information content, and the scientific value of the paper in relation to compactness of presentation.. The results of the present study have been discussed in relation to Bradford's Law of Scattering and an extension of the Law has been suggested, namely, that during phases of rapid and vigorous growth of knowledge in a scientific disciplines, articles of interest to that discipline appear in increasing numbers in periodicals distant from that field.. It is expected that the present ranking list will enable librarians and other professional workers in the field of biochemistry to select journals from the viewpoint of their significance to the active areas or present day biochemical research.."
    },
    {
       "Query ID":"21",
       "Query":"The need to provide personnel for the information field.",
       "KL Rate":5.74705576477236,
       "Document ID":"17",
       "Document Title":"Adventures in Librarianship",
       "Document Body":"There has long been a need for a continuing series to provide scholarly reviews of the rapidly changing and advancing field of librarianship, a series which would select subjects with particular current significance to the profession and provide an analysis of the advances made through research and practice. Advances in Librarianship is planned and designed to fill this need. It will present critical articles and surveys based on the published literature, research in progress, and developments in libraries of all types. Mechanization may appear to be the most obvious of the advancing fronts of librarianship, for automation has caught the enthusiastic support of all librarians who can visualize its potential. Advances in this field will certainly be found in every volume of this series. As the first group of articles in this volume demonstrate, technological change has an obvious and direct implication for libraries, but the problem has been found to be much more complex than the simple inventory problem many experts expected. Advances in Librarianship is dedicated to presenting the realities of automation, assessing where we are, where we are going, and how fast we can hope to get there. \"The Machine and Cataloging\" reviews the current status of the machine-produced book catalog and what lies ahead as we enter the age of MARC. Where business methods have greater applicability, progress is easier, as reported in \"Mechanization of Acquisition Processes.\" Even in this area generally acceptable practices and standardization are in the future, not the past. One of the problems of major and immediate importance in computerization of catalog information is that discussed in \"Filing Systems for Computer Manipulation.\" This detailed review presents the complexity of the problems and suggests possible solutions. For many years technical service costs have been defended without adequate knowledge of the facts. As automated procedures are proposed, standards are determining costs of traditional operations become essential. The article on standards for such costs shows why the problems have been difficult and reviews the significant advances of the past few years. The school library has widened its dimensions in materials and services much more rapidly than other libraries, as reflected in its new name, the instructional media center. Here, technical change, together with new teaching methods, has made possible major developments in library service in schools as well as for children in the public library. Two articles make clear that what can be done has been demonstrated, and that what remains is to make this the rule rather than the exception. Bibliotherapy is an example of a field in which progress has been slow. Articles which illustrate the potential which systems theory and managerial planning theory have for libraries. The articles on the application of these concepts, which come from research in administration, are provocative and may appear controversial to some. The article on library development in developing countries provides an analysis in depth of our efforts and degree of success in assisting other countries in providing the library service which is so important in the modern world."
    },
    {
       "Query ID":"22",
       "Query":"Automated information in the medical field.",
       "KL Rate":5.591091602435827,
       "Document ID":"17",
       "Document Title":"Adventures in Librarianship",
       "Document Body":"There has long been a need for a continuing series to provide scholarly reviews of the rapidly changing and advancing field of librarianship, a series which would select subjects with particular current significance to the profession and provide an analysis of the advances made through research and practice. Advances in Librarianship is planned and designed to fill this need. It will present critical articles and surveys based on the published literature, research in progress, and developments in libraries of all types. Mechanization may appear to be the most obvious of the advancing fronts of librarianship, for automation has caught the enthusiastic support of all librarians who can visualize its potential. Advances in this field will certainly be found in every volume of this series. As the first group of articles in this volume demonstrate, technological change has an obvious and direct implication for libraries, but the problem has been found to be much more complex than the simple inventory problem many experts expected. Advances in Librarianship is dedicated to presenting the realities of automation, assessing where we are, where we are going, and how fast we can hope to get there. \"The Machine and Cataloging\" reviews the current status of the machine-produced book catalog and what lies ahead as we enter the age of MARC. Where business methods have greater applicability, progress is easier, as reported in \"Mechanization of Acquisition Processes.\" Even in this area generally acceptable practices and standardization are in the future, not the past. One of the problems of major and immediate importance in computerization of catalog information is that discussed in \"Filing Systems for Computer Manipulation.\" This detailed review presents the complexity of the problems and suggests possible solutions. For many years technical service costs have been defended without adequate knowledge of the facts. As automated procedures are proposed, standards are determining costs of traditional operations become essential. The article on standards for such costs shows why the problems have been difficult and reviews the significant advances of the past few years. The school library has widened its dimensions in materials and services much more rapidly than other libraries, as reflected in its new name, the instructional media center. Here, technical change, together with new teaching methods, has made possible major developments in library service in schools as well as for children in the public library. Two articles make clear that what can be done has been demonstrated, and that what remains is to make this the rule rather than the exception. Bibliotherapy is an example of a field in which progress has been slow. Articles which illustrate the potential which systems theory and managerial planning theory have for libraries. The articles on the application of these concepts, which come from research in administration, are provocative and may appear controversial to some. The article on library development in developing countries provides an analysis in depth of our efforts and degree of success in assisting other countries in providing the library service which is so important in the modern world."
    },
    {
       "Query ID":"31",
       "Query":"Information systems in the physical sciences.",
       "KL Rate":5.3233024244634795,
       "Document ID":"535",
       "Document Title":"Information Systems, Services, and Centers",
       "Document Body":"This book is concerned with the practices of information transfer and use. It examines information science for the purpose of control of the information \"flood\" through systems, services, and centers. The book is designed as a text for use at the university level and as a reference source for working information scientists and specialists, for documentalists, for engineers and for researchers in the physical, life, and social sciences."
    },
    {
       "Query ID":"34",
       "Query":"Methods of coding used in computerized index systems.",
       "KL Rate":5.169984260073973,
       "Document ID":"376",
       "Document Title":"Encyclopedia of Information Systems and Services",
       "Document Body":"This publication describes and analyzes approximately 1750 organizations concerned with new forms, new media, and new methods for providing information services. Among these organizations are publishers, computer software and time- sharing companies, micrographic firms, libraries, information centers, and consultants. The common interest of these diverse organizations is in service based on storage and representation of structured information with output on a recurring or demand basis. The concept of information as used throughout this book is defined as data organized into a collection of facts and most often recorded in two basic forms: 1) textual data or literature, and 2) numeric data. Roles played by the organizations described on the following pages vary but include one or more of the following functions: data base creation, data base publishing, data transmission, data manipulation and analysis, and data storage and retrieval. Emphasis in this publication is on organizations involved in computerized services, micrographic applications, selective dissemination of information (SDI), and networking. Not included in the Encyclopedia of Information Systems and Services are printed commercial and legal services, traditional academic and special libraries, public information offices, hardware manufacturers and distributors within the computer and micrographic field, conventional indexing and abstracting services, and most library automation programs which are limited to such housekeeping functions as circulation, serials control, and acquisitions."
    },
    {
       "Query ID":"3",
       "Query":"What is information science? Give definitions where possible.",
       "KL Rate":5.1103358934127785,
       "Document ID":"160",
       "Document Title":"Analysis and Organization of Knowledge for Retrieval",
       "Document Body":"In a university, the mode of research is usually what is called 'pure' or 'basic' research; since I am keeping in mind primarily the applications of information science, I will prefer the word 'basic', although there is not so much difference. In such research, and really in any good research, one should not be collecting data haphazardly. One must isolate and define a problem and, as far as possible, control other conditions so that interfering factors are eliminated. Preferably one will narrow down the problem to manageable proportions. It is then essential to approach the problem with some sort of hypothesis or theory of the situation, and to concentrate on obtaining evidence for or against that hypothesis. The important task is to devise just that crucial experiment which will give the answer as efficiently as possible. If the answer disproves the hypothesis, one has at least further evidence upon which to construct a different hypothesis; if it confirms the hypothesis, one is ready for a further step forward, and so on. Research is easier in a fully controlled and reproducible situation; in a biological or human situation one must often have recourse to statistical methods, but this does not alter the general methodology. On the whole, I find a clear methodology lacking in much that is being done in the field of information science today."
    },
    {
       "Query ID":"33",
       "Query":"Retrieval systems which provide for the automated transmission of information to the user from a distance.",
       "KL Rate":5.00297869226436,
       "Document ID":"17",
       "Document Title":"Adventures in Librarianship",
       "Document Body":"There has long been a need for a continuing series to provide scholarly reviews of the rapidly changing and advancing field of librarianship, a series which would select subjects with particular current significance to the profession and provide an analysis of the advances made through research and practice. Advances in Librarianship is planned and designed to fill this need. It will present critical articles and surveys based on the published literature, research in progress, and developments in libraries of all types. Mechanization may appear to be the most obvious of the advancing fronts of librarianship, for automation has caught the enthusiastic support of all librarians who can visualize its potential. Advances in this field will certainly be found in every volume of this series. As the first group of articles in this volume demonstrate, technological change has an obvious and direct implication for libraries, but the problem has been found to be much more complex than the simple inventory problem many experts expected. Advances in Librarianship is dedicated to presenting the realities of automation, assessing where we are, where we are going, and how fast we can hope to get there. \"The Machine and Cataloging\" reviews the current status of the machine-produced book catalog and what lies ahead as we enter the age of MARC. Where business methods have greater applicability, progress is easier, as reported in \"Mechanization of Acquisition Processes.\" Even in this area generally acceptable practices and standardization are in the future, not the past. One of the problems of major and immediate importance in computerization of catalog information is that discussed in \"Filing Systems for Computer Manipulation.\" This detailed review presents the complexity of the problems and suggests possible solutions. For many years technical service costs have been defended without adequate knowledge of the facts. As automated procedures are proposed, standards are determining costs of traditional operations become essential. The article on standards for such costs shows why the problems have been difficult and reviews the significant advances of the past few years. The school library has widened its dimensions in materials and services much more rapidly than other libraries, as reflected in its new name, the instructional media center. Here, technical change, together with new teaching methods, has made possible major developments in library service in schools as well as for children in the public library. Two articles make clear that what can be done has been demonstrated, and that what remains is to make this the rule rather than the exception. Bibliotherapy is an example of a field in which progress has been slow. Articles which illustrate the potential which systems theory and managerial planning theory have for libraries. The articles on the application of these concepts, which come from research in administration, are provocative and may appear controversial to some. The article on library development in developing countries provides an analysis in depth of our efforts and degree of success in assisting other countries in providing the library service which is so important in the modern world."
    },
    {
       "Query ID":"8",
       "Query":"Describe information retrieval and indexing in other languages. What bearing does it have on the science in general?",
       "KL Rate":4.966860983658116,
       "Document ID":"1248",
       "Document Title":"Reader in Library Service and the Computer",
       "Document Body":"The selections are intended mainly for students in library schools, and for librarians in the field who have not yet made themselves conversant with the literature of computer-based operations. This is not a book, to state the proposition in the negative, for those who wish to read on the theoretical aspects of computers. The selections are brought together in seven sections. The first, the Challenge, includes material on what is expected of librarians in the age of the computer. The second section, Varieties of Response, does not by any means exhaust developments in American libraries. It does, I believe, contain representative descriptions of some of the best work being accomplished. The third section, Theory of Management, contains an outstanding article by Richard DeGennaro of Harvard. The particular contributions made in this article are described in the editorial comment immediately preceding this third section. News Services, the fourth section, required a considerable degree of selection among a wealth of material, and is indicative of the wide variety of services which libraries are beginning to offer in the age of the computer. The considerable range of such services is exhaustively indicated in the first selection of this section, while those that follow describe specific services now being offered, or services in the planning stage. The material in the fifth section, Catalogs and the Computer, is on a subject that has elicited considerable discussion. The two articles selected are on two aspects of the subject, namely, filing problems, and comparative costs. The sixth section, Copyright, contains an article from the legal point of view. The more traditional library view of copyright has been ably represented by Verner Clapp in an article cited in the section on additional readings. The seventh section, Information Retrieval Testing, is a subject which has excited the attention of but few librarians, yet its influence on subject indexing could in time prove considerable."
    }
 ]